Merge pull request #22 from stipot/rev2026
rev 0.1.1
